[
  {
    "id": 1,
    "titulo": "O que aprendi até o momento",
    "texto": "Desde que comecei a faculdade este ano, já tive algumas disciplinas que fizeram com que eu criasse uma visão mais concreta sobre programação, esta página está sendo feita no momento onde estou no segundo semestre, então, algumas discplinas que me auxiliaram muito foram arquitetura de computadores, design de software, diagramas para criação de um software, programação extrema, dentre outros. \n\n ![Estrutura de um diagrama de caso de uso](/posts/1/diagramaDeCasoDeUso.jpg) A linguagem que me foi introduzida na faculdade até o momento foi Java, da qual gosto muito da forma que é utilizada, do seu layout e construção que deve ser feito para o código, acho ela uma linguagem muito intuitiva para entender o seu funcionamento, e, visualmente, carrega este mesmo ponto. A faculdade da qual faço parte é de modelo EAD, sendo assim, nos momentos em que finalizava atividades referentes as disciplinas, corria para buscar cursos, vídeos, informações sobre outras linguagens, para que eu me inserisse cada vez mais neste universo e compreendesse ainda mais como cada uma se relacionava e suas utilidades, sendo assim, com os cursos fui atrás de Java novamente, vi a utilização de HTML e CSS, em seguida procurando o funcionamento da linguagem JavaScript, já que estas se relacionam, e também um pouco de PHP, Python, C, C#, C++, e o básico de outras pesquisas, o que me deram uma base muito importante para o que eu viveria pela frente. \n\n ![Logo JavaScript](/posts/1/javascript.jpg)Neste ano consegui entrar em um estágio, o que foi um boom para me alavancar no entendimento da programação, mesmo que eu saiba apenas o básico, não 100% de como programar, toda essa base que aprendi por mim mesma foi importante, e me auxiliou com que não tivesse um choque tão grande ao iniciar o estágio. Nele, fui introduzida a mais estudos de HTML, CSS e Javascript, vi pela primeira vez Node.Js, React, a junção dos dois para um funcionamento fullstack, Git&GitHub e Azure, todo este aprendizado deixou que as informações ficassem mais concretas, e hoje, estou atrás de desenvolver mais confiança para fazer códigos, e desenvolver mais conhecimento para faze-los. ![Logo e código de fundo exemplificando como é a utilização da biblioteca React](/posts/1/react.jpg)"
  },
  {
    "id": 2,
    "titulo": "Quais linguagens me identifiquei mais",
    "texto": "Nos períodos em que realizava cursos simultaneamente com a faculdade, senti maior desenvolvimento em frontend, gostando muito de JavaScript, entretanto, ainda queria aprender mais sobre linguagens backend para me tornar fullstack. \n\nAo decorrer do estágio, me identifiquei muito com React, achei a estrutura extremamente interessante, intuitiva e tudo fazia sentido, e acredito que, no momento, me identifico muito com esta biblioteca de JavaScript, e quero tentar me desenvolver ainda mais na sua utilização, claro, ainda busco mais conhecimento para me tornar uma profissional fullstack, mas a utilização da biblioteca react se tornou algo extremamente interessante para mim."
  },
  {
    "id": 3,
    "titulo": "Visão do futuro",
    "texto": "Como visão de metas que tenho nos próximos meses em relação ao momento que estou, quero me desenvolver cada vez mais no estágio, me desenvolvendo mais ainda em questão na empresa, pois estou gostando muito de atuar aqui, e tenho aprendido cada dia mais coisas, sendo assim, espero conseguir mais conhecimento para me tornar fullstack, ou até mesmo para ser uma boa profissional frontend. \n\nEm questão de 10 anos ou mais, quero tentar atuar na área de jogos eletrônicos, tenho muito interesse nesse universo, e caso eu consiga atingir esta parte, espero estar na parte de programação dos jogos, entretando, tenho interesse pelo desenvolvimento visual, o design de personagens, cenários e entre outros, com isso, tenho tentado aprender a mexer em plataformas 3D como Blender e ZBrush, tenho conhecimento em Solid Works, mas este não é utilizado para estes propósitos, e também utilizo com frequência plataformas de desenho digital, que nesse caso seriam utilizados para sketch ou a parte visual que foi definida para ser feita no jogo, excluindo jogos 2D que podem acabar utilzando estas ferramentas, outra parte desta área que me chama atenção seria a criação dos roteiros, o desenvolvimento da história. \n\n ![Exemplo de criação no blender](/posts/3/exemplo_blender.jpg)Tudo isso me chama muita atenção, mas, de passo em passo espero chegar neste lugar, pois preciso me desenvolver mais no que estou agora, para adquirir mais conhecimento ao decorrer de minha caminhada, sendo assim, meu foco é o agora, que já é algo extremamente incrível para mim."
  },
  {
    "id": 4,
    "titulo": "Arte",
    "texto": "Uma das minhas maiores conexões é com o meio artítico, principalmente com desenho, pintura, criações feitas à mão, assim como já tive contato com dança e música. Neste caso, descreverei mais a parte de desenhos e outras criações. \n\n Minha evolução começou aos poucos, incialmente comecei através de desenhos no papel, sem cores nem nada, sempre gostei dos traços mais livres, com sombra, meio bagunçados, mas depois de um certo momento decidi pintar em tela, e desenvolvi um outro interesse por um estilo realista, misturar a tinta e fazer diferentes composições na tela, e foi assim por um bom momento, até que decidi testar o desenho digital. \n\n Digitalmente o que mais fazia eram edições de vídeo e layouts de design, coisas que também gosto muito de fazer e tenho grande interesse, até que decidi baixar um aplicativo de desenho no celular para começar a desenhar, não tinha mesa para isso então fazia diretamente com o dedo, e quando adquiri a mesa, parti para os desenhos no computador, e hoje faço alguns em uma certa frequência, para desenvolver a criatividade e também como um hobby, um momento para descontrair do dia a dia. \n\n Hoje em dia estou tentando aprender a utilizar os softwares de desenvolvimento 3D, Blender e ZBrush, por conta do meu interesse por desenvolvimeto de personagens de jogos, todo o processo do seu design até a decisão final. O único software deste tipo que utilizei foi o SolidWorks anteriormente, entretanto, ele possui uma finalizade mais para o lado industrial, peças, ferramentas, desenho de produtos e etc. \n\n Sempre busco por referências para desenvolver meus desenhos, não considero que possuo um estilo específico, pois sempre estou testando traços e composições novas, mas acredito que possuo um estilo no momento de colorir as imagens, tanto ao pintar telas ou em desenhos digitais, gosto de utilzar a esfumação para misturar as cores, as deixando mais uniformes e sem traços. Estes detalhes e um pouco do que já produzi terão amostras no card de 'Blender, desenho e outros'. "
  },
  {
    "id": 5,
    "titulo": "Blender, desenho e outros",
    "texto": "Nesta seção, irei mostrar alguns exemplos de produções que fiz, algumas delas referenciadas por fotos ou desenhos de outros artistas, alguns são uma mescla de imagens que encontrei, e criações do blender são feitas por tutoriais no youtube, já que estou começando a utilizar agora então é uma boa forma de aprender e pegar uma base das ferramentas. Também comecei a utilizar a ferramenta ZBrush, mas, como estou ainda me familiarizando não cheguei a produzir algo, e a versão que utilizo também é limitada em questão de ferramentas, da mesma forma estou testando para conhecê-la, já que me chamou a atenção o seu funcionamento.\n\n Desenho digital: Este primeiro desenho o fiz utilizando o app ibisPaint X pelo celular, e seria referente a uma fotografia que encontrei na rede Pinterest, e então decidi testar e desenhar. ![Desenho de um carro realizado em um aplicativo de celular](/posts/5/desenho1.png)\n\n Este segundo desenho já foi realizado no software FireAlpaca através de um computador, e surgiu de uma ideia da qual fui unindo referências para finalizar o desenho. ![Desenho de uma mão segurando uma cabeça como se fosse um vaso de plantas realizado em software de senho no computador](/posts/5/desenho2.jpg)\n\n Quadro: Essa pintura foi uma das que mais elaborei para sua realização, fazendo marcações na tela de acordo com a imagem, e tentando o máximo possível sua aproximação com o desenho original. ![Quadro da personagem Lulu de league of legends](/posts/5/pintura.png)\n\n Miniaturas: Algumas vezes arrisco realizar algumas produções manualmente, e, neste caso, decidi reproduzir os quartos dos personagens da série de livros Heartstopper, me referenciando por imagens criadas no Blender. ![Miniaturas quartos dos personagens da série de livros Heartstopper realizado com materiais encontrados em casa](/posts/5/quartos.jpg)\n\n Blender: Esta foi a primeira criação que fiz utilizando o Blender, meu primeiro contato, através do tutorial [Blender 3D Beginner Tutorial: Smooth 3D Living Room](https://youtu.be/dEGJeVnWZAA?feature=shared). No post 'Visão do futuro' também utilizei o tutorial [Blender 3D - Create a SNOWY Winter House in 20 minutes | Beginner Tutorial](https://youtu.be/jYXZYKRDj4g?feature=shared). ![3D de uma sala realizada no Blender](/posts/5/blenderRoom.jpg)\n\n"
  },
  {
    "id": 6,
    "titulo": "Jogos",
    "texto": "Como já mencionei anteriormente, jogos eletrônicos são um de meus maiores interesses, acho fascinante como é possível algo unir pessoas, se tornar nostálgico ao passar da vida, uma memória boa de quando foi jogado. Para mim, desde sempre estive em contato com este universo, lembro de quando criança jogar muito video game, dos mais diversos jogos possíveis, e ao crescer fui conhecendo outros tipos, entendendo narrativas, desenvolvendo maiores interesses. \n\n Jogos focados em narrativa, na história são os que mais me chamam atenção, não entenda mal, jogos para aumentar de nível, jogar online, desenvolver seu personagem são incríveis, mas jogos de narrativa envolvem você com o personagem, com a história dele. Um jogo que acredito ter passado muito isso foi The Last Of Us, desde o primeiro ao segundo, e este é um bom exemplo de envolvimento, pois, a comunidade que gostou do primeiro jogo se envolveu muito com o segundo, por ter se integrado a história dos personagens, em toda a narrativa, muitos outros jogos que são lançados em sequência ou apenas um também tiveram esse grande impacto, de criar comunidades apaixonadas naquilo, e não desenvolver apenas a história, mas muitas vezes os gráficos, o estilo de jogo, a mecânica de funcionamento, tudo isso implica, mas, nem sempre. ![Capa do jogo The Last Of Us](/posts/6/tlou.jpg) \n\n Muitas vezes jogadores se apegam aos gráficos, e claro, isso tem uma grande impacto no jogo, principalmente em jogos narrativos, pois traz uma realizade imensa ao que está sendo visto, entretanto, há jogos, como por exemplo Undertale e To The Moon, que apresentar um gráfico 2D com simplicidade, mas que a história toca o coração profundamente, pois, não basta ter os melhores gráficos, mas precisa de um bom desenvolvimento e envolvimento da equipe que o cria. ![Capa jogo Undertale](/posts/6/undertale.jpg) ![Imagem cena do jogo To the moon](/posts/6/toTheMoon.jpg)\n\n Acredito que um dos maiores motivos pelo gosto que tenho em jogos narrativos são os ensinamentos passados durante ele, como exemplo, jogos de escolha, onde o que o jogador decidir poderá mudar o futuro daquele personagem, como exemplo temos Detroit Become Human e Until Dawn, a vida também é dessa forma, e acredito que jogos assim trazem essa reflexão. Com isso, gostaria de falar sobre meu jogo favorito, que é focado em escolhas, não tem um gráfico que chamaria muita atenção, mas sua direção de arte é incrível, trazendo um estilo diferente, a trilha sonora complementa tudo isso, estou falando de Life is Strange. ![Capa jogo Detroit Become Human](/posts/6/dbh.jpg) ![Capa jogo Until Dawn](/posts/6/ud.jpg)\n\n Neste caso aqui irei comentar sobre o primeiro que foi lançado, já que existem também o Life is Strange Before the Storm, Life is Strange 2, Life is Strange True Colors, e as dlc's do Capitão Spirit e a de Life is Strange Before the Storm. ![Capa jogo Life is strange](/posts/6/lifeisstrange.jpg)\n\n O primeiro jogo é realizado na narrativa da personagem Max, que retorna para cidade onde cresceu depois de anos para estudar fotografia, no início nos deparamos com uma cena onde max tem um pesadelo de um furacão atingindo Arcadia Bay, local onde o jogo se passa, ao acordar, ela está na sala de aula, no intervalo entre as aulas ela decide ir ao banheiro, até o momento, mesmo com o pesadelo, tudo parece normal, entretanto, ao avistar uma borboleta azul e ir em direção a esta para tirar uma foto, ela escuta duas pessoas entrando no banheiro, um garoto e uma garota, parecem estar tendo uma discução, em seguida, Max só percebe o garoto puxar uma arma em direção a outra pessoa, como reflexo ela se estende para tentar impedir, e tudo volta ao momento na sala de aula, Max tem o poder de voltar no tempo, e, mais tarde, descobre que a garota no banheiro era sua melhor amiga de infância. A história se segue assim, onde ela aprende sobre seus poderes e tenta tomar as melhores decisões para que o furacão não atinja a cidade ao terminar da semana. \n\n É um jogo extremamente envolvente, mas extremamente narrativo, então, para aqueles que não curtem muito, tomem cuidado ao assistir, pois ele poderá parecer muito lento, muito arrastado por um tempo, mas acredito que seja interessante, ainda mais pelo sistema de escolhas e as reflexões que ele pode causar. Isso que me interessa nos jogos, o impacto que ele pode ter sobre as pessoas, além das diversas possibilidades de diferentes tipos de jogos que podem ser criados."
  },
  {
    "id": 7,
    "titulo": "Cinema",
    "texto": "O envolvimento do público com jogos também pode ser encaixado em filmes, aquele gostinho de ir ao cinema ver um lançamento, ou até mesmo esperar uma tarde de domingo para ver o que irá passar na tv, ficar minutos escolhendo o que assistir durante à noite, e dentre outras situações. Filmes retratam a realidade, ou coisas completamente fora do que poderia ocorrer, retratam o passado e uma tentativa de adivinhar como será o futuro, desde comédia, ação, romance ou terror, tudo é possível no cinema, das maiores empresas e produções até curtas realizados por pequenos grupos de pessoas. \n\n A composição cinematográfica, cores, posicionamento, o enquadramento de cena que foi escolhido para dar uma sensação maior ao momento capiturado, essas coisas me chamam muito a atenção, posso até dizer que peguei a mania mais chata de ficar fazendo estas análises ao assistir um filme, mas, assim como nos jogos, as narrativas que tocam mais profundamente são as que chamam mais atenção. A seguir, irei colocar alguns cartazes de filmes que considero como alguns dos meus preferidos, tanto em narrativa como em questões técnicas. \n\n Sociedade dos poetas mortos é um filme do fim dos anos 80, retratando uma escola só para meninos onde eles são direcionados a cursos de engenharia, medicina, direito, mas muitos não se interessam por esse caminho, e então, conhecem seu professor de filosofia, Mr.Keating, que mostra outra visão de mundo para estes garotos. \n\n ![Capa do filme Sociedade dos Poetas Mortos](/posts/7/dps.jpg) \n\n O Grande Hotel Budapeste, filme de 2014, retrata o grandioso hotel que com os anos cai em esquecimento, retratando principalmente o momento onde o M. Gustave tomava conta do local, mostrando sua dedicação com o estabelecimento, até que se mete em um grande problema. O filme dirigido por Wes Anderson, que dá seu toque cinematográfico deixando cores e enquadramentos extremamente incríveis, tem uma narrativa extremamente divertida de se assistir. \n\n ![Capa do filme O Grande Hotel Budapeste](/posts/7/oghb.jpg) \n\n Cinema Paradiso filme também do fim dos anos 80 conta a história de um garoto que morava em uma cidade pequena, e o local que mais é retratado seria o cinema desta cidade, o garoto conhece o senhor que é encarregado das projeções dos filmes, e ambos se tornam grandes amigos, e este contato desenvolve o grande amor pela dramaturgia, pelo cinema no garoto. Outros momentos também são mostrados, como o contexto da segunda guerra mundial que atinge a cidade. O filme inicia com a visita do garoto, já adulto, à cidade, pois o senhor que lhe ensinou muito sobre o cinema havia falecido, com isso, ao decorrer da produção, vemos os momentos vividos por ambos naquele cinema cheio de memórias, além de uma visão sobre os filmes e seu impacto na vida de muitos. \n\n ![Capa do filme Cinema Paradiso](/posts/7/cinemaparadiso.jpg) \n\n Little Miss Sunshine, filme de 2006, retrata os esforços da família para levarem a filha mais nova até uma competição de beleza, entretanto, não é uma atividade tão fácil, e a família precisa se reestabelecer, conhecer melhor um ao outro, e compartilhar diversos ensinamentos da vida, para no fim terem uma união. Acho que é um filme cheio de mensagens interessantes em relação ao ambiente familiar e a nós como indivíduos, é divertido de assistir mas ao mesmo tempo tocante em relação aos assuntos que retrata. \n\n ![Capa do filme Little Miss Sunshine](/posts/7/lms.jpg) \n\n Close, filme de 2022, retrata a vida de dois amigos de infância, que convivem juntos desde sempre, dormem na casa um do outro, brincam juntos, passam o verão inteiro se divertindo na companhia um do outro, mas, ao iniciar as aulas da escola, aquele local que existia apenas deles naquele pequena cidade se quebra, com o preconceito, olhares maldosos e falas maldosas de outras pessoas, o que acaba gerando um grande desastre. A produção do filme é extremamente linda, todas as imagens, composição de cores, tudo compondo algo extremamente tocante que complementam a história, a deixando ainda mais envolvente. \n\n ![Capa do filme Close](/posts/7/close.jpg) \n\n A voz do silência é uma animação do ano de 2016, que retrata a vida de um jovem que, durante a sua infância, era um encrenqueiro, e praticava bullying, principalmente com uma garota deficiente auditiva. Quando adulto, após um acontecimento nos episódios que praticava bullying em sua infância, tudo mudou, e após crescer lida com algumas das consequências, e tenta se tornar alguém melhor, aprender a viver certas coisas depois de anos, como a amizade. É uma animação extremamente linda, o estilo de arte combina com toda a produção, e a história sempre ficará marcada depois de ser assistida. \n\n ![Capa do filme A voz do silêncio](/posts/7/avds.jpg) \n\n Para você que é um apaixonado por cinema como eu, indico o Letterbox, pode ser baixado no celular ou utilizado no navegador, nele você pode classificar filmes, criar uma lista com filmes que quer assistir e ver recomendações de outras pessoas. Caso queira ver as minhas listas, aqui está o link do [Letterboxd](https://letterboxd.com/gisagisa/)."
  },
  {
    "id": 8,
    "titulo": "Livros",
    "texto": "Confesso que meus hobbys são bem comuns, e aqui estamos com mais um deles, leitura. comecei a ler quando pequena, mas nunca foi algo frequênte, quando cresci, pelos meus 13 anos de idade comecei a ler sagas, depois de um tempo entrei em uma ressaca literária, mas voltei com tudo lendo diversos tipos de livros. \n\n Não sei se possuo um gênero favorito, uma prática que costumo ter é, se leio um livro mais sério e pesado de conteúdo, o próximo será mais leve, e vice-versa, para manter um bom nivelamento de leitura. \n\n Ler se tornou uma boa prática para treinar vocabulário, tanto para fala quanto para escrita, exercitar a imaginação e criatividade, além de ter um repertório de assuntos maior. Comecei a ler livros em inglês para exercitar a parte do vocabulário em outro idioma, o que é uma boa prática para qualquer idioma que quiser. \n\n Assim como filmes ou jogos, essa é uma atividade envolvente, te faz chorar, rir, ter medo, dentre tantas outras emoções, e é um momento de calma diante toda a rotina do dia a dia. \n\n Se você é apaixonado por livros como eu, recomendo utilizar a plataforma skoob, onde é possível classificar livros, marcar quais que deseja ler, quais parou de ler, criar uma estante toda classificada e organizada, além de ver indicações e classificações de outras pessoas. Para não tornar o assunto tão extenso para dar indicações, caso queira ver a minha estante, aqui está o link do [Skoob](https://www.skoob.com.br/perfil/gisagisahmmm)."
  },
  {
    "id": 9,
    "titulo": "Projeto ensino médio",
    "texto": "Durante o ensino médio, na escola onde estudei, o formato de ensino envolvia desenvolver projetos/trabalhos a cada semana para cada área, e no fim dos 3 anos deveríamos apresentar um projeto em grupo para conclusão do ensino médio, como se fosse um TCC. Cada grupo de alunos poderia escolher uma área onde o projeto fosse aplicado, devendo desenvolver protótipos, um produto final, o artigo, realizar apresentações, e claro, a apresentação final que definiria se o projeto seria aprovado. \n\n O projeto desenvolvido pelo meu grupo se chamava Shad Sol, um jogo eletrônico para tratar a vivência de pessoas LGBTQIAP+, o preconceito, a violência que eram submetidos, o jogo era para ser aplicado em escola para educadores, pois, assim, eles poderiam estar mais próximo de alunos que muitas vezes sofrem bullying, são expulsos de casa, são violentados. A escolha de um local escolar chegaria mais próximo a adolescentes, e ao mesmo tempo estaria em contato com adultos, que poderiam aprender mais sobre a comunidade. \n\n Foram lidos artigos para a formação do nosso próprio artigo, assim como para criar questionários para serem aplicados entre alunos e educadores, onde, para os educadores, foram analisadas respostas de uma escola pública e uma escola privada, para saber as diferenças de como cada uma lidava com certas situações. Aplicamos o jogo com educadores, além de realizar uma apresentação para mostrar o desenvolvimento do jogo, seu intuito, e pesquisas que foram feitas para concretizar a base teórica. \n\n Nosso projeto conseguiu ser selecionado para ser apresentado no evento UFRGS Jovem e no evento de robótica da cidade de Gravataí, ganhando primeiro lugar como projeto de pesquisa. \n\n Levamos cerca de dois anos para concluí-lo, desde pesquisas, testes, desenvolvimento do jogo e aplicações. Foi criado através do software RPG Maker MV, e no final totalizou 57 minutos de de jogabilidade. \n\n A história se passa na vida de Shad Sol, personagem criado para ser neutro, sem definições de gênero nem aparência, para ser como se fosse uma sombra conforme as decisões do jogador. Shad tinha uma vida normal, escola, voltar pra casa, amigos, e assim em diante, entretanto, quando ia dormir durante a noite tinha sonhos estranhos, ele se via presente na vida de outras pessoas, e cada uma delas era uma representação de pessoas da comunidade LGBTQIAP+, cada uma delas tinha uma situação diferente, onde Shad deveria tomar decisões para tentar achar as melhores soluções, após os sonhos, ao acordar e se dirigir ao caminho que sempre conheceu para a escola, ele acabava encontrando estas pessoas pelo caminho, e era possível perceber que cada acontecimento tinha sido real. No final do jogo, dependendo das decisões tomadas. \n\n As situações descritas representavam momentos de angústia, preconceito vindo de pessoas que amamos ou a aceitação dessas pessoas. O roteiro para o jogo levou cerca de um ano, baseando-se em um protótipo que foi criado para um trabalho da área de humanas, do qual decidimos levar para frente e tívemos estas realizações. \n\n Acredito que este foi meu primeiro contato com programar algo, ainda mais um jogo, e cada momento do projeto, mesmo com estresse e dificuldades, foi algo que ficará sempre marcado, um projeto que adorei fazer e poder criar junto ao meu grupo, do qual foi essencial para tornar tudo isso possível. \n\n Caso queira ver um pouco de como foi o jogo, tempos o trailer de [Shad Sol](https://youtu.be/8JIFDkL52Nc?feature=shared)."
  }
]